src/main/resources/xmls/salesforcequery/UpdateEventRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<update xmlns="urn:partner.soap.sforce.com">
			<sObjects>
				<type xmlns="urn:sobject.partner.soap.sforce.com">Event</type>
				<Id xmlns=""></Id>
				<Job_Posting__c xmlns=""></Job_Posting__c>
				<WhoId xmlns=""></WhoId>
				<Subject xmlns=""></Subject>
				<Type xmlns=""></Type>
				<StartDateTime xmlns="">2019-01-11T06:00:00.000Z
				</StartDateTime>
				<EndDateTime xmlns="">2019-01-11T06:01:00.000Z
				</EndDateTime>
			</sObjects>
		</update>
	</Body>
</Envelope>
